[
  {
    "text": "This two-wave longitudinal study examined how developmental changes in students' mastery goal orientation, academic effort, and intrinsic motivation were predicted by student-perceived support of motivational support (support for autonomy, competence, and relatedness) in secondary classrooms. The study extends previous knowledge that showed that support for motivational support in class is related to students' intrinsic motivation as it focused on the developmental changes of a set of different motivational variables and the relations of these changes to student-perceived motivational support in class. Thus, differential classroom effects on students' motivational development were investigated. A sample of 1088 German students was assessed in the beginning of the school year when students were in grade 8 (Mean age = 13.70, SD = 0.53, 54% girls) and again at the end of the next school year when students were in grade 9. Results of latent change models showed a tendency toward decline in mastery goal orientation and a significant decrease in academic effort from grade 8 to 9. Intrinsic motivation did not decrease significantly across time. Student-perceived support of competence in class predicted the level and change in students' academic effort. The findings emphasized that it is beneficial to create classroom learning environments that enhance students' perceptions of competence in class when aiming to enhance students' academic effort in secondary school classrooms.",
    "spans": [
      {
        "start": 716,
        "end": 720,
        "label": "SAMPLE_SIZE",
        "text": "1088"
      }
    ]
  },
  {
    "text": "The objectives of this study were to determine the influence of various motivation variables on task-specific mathematics performance and to explore whether these variables change during the first year of middle school (N ϭ 273). Students' taskspecific self-efficacy was the only motivation variable to predict performance and did so both at start and end of year. There were no differences in anxiety, selfconcept, or self-efficacy for self-regulation between start and end of year, but, by end of year, students described mathematics as less valuable and reported lower effort and persistence. Gifted students had stronger mathematics self-concept beliefs, and they had more accurate and less overconfident self-efficacy beliefs than did regular education students. There were no gender differences in any of the motivation constructs.",
    "spans": [
      {
        "start": 224,
        "end": 227,
        "label": "SAMPLE_SIZE",
        "text": "273"
      }
    ]
  },
  {
    "text": "Introduction. -The contribution of the learning climate and attachment security to students' academic competence and anxiety symptoms during the middle school transition has not been examined. Objectives. -The main purpose of this prospective study was to examine the complementary contributions of these two contextual determinants. A second goal was to test the moderating effect of attachment security perceived by students in the relationship between the learning climate and both outcomes (academic competence, anxiety symptoms). Method and results. -Participants were 627 students in Grade 6 (54% girls). Latent structural modeling analysis revealed that a mastery climate predicted higher levels of perceived academic competence perceived in the first year of middle school, although attachment security to the mother in Grade 6 predicted perceived academic competence and anxiety symptoms in the first year of middle school. A moderating effect was found, in which greater attachment security to the mother appeared to lessen the relationship between a performance climate and anxiety symptoms during the middle school transition. Conclusion. -The results suggest that attachment security to the mother predicts perceived academic competence and anxiety symptoms during the middle school transition. Additionally, attachment security to the mother can moderate the potentially harmful effects of a learning climate emphasizing social comparison and performance on anxiety.",
    "spans": [
      {
        "start": 574,
        "end": 577,
        "label": "SAMPLE_SIZE",
        "text": "627"
      }
    ]
  },
  {
    "text": "Research based on the Eccles model of parent socialization demonstrated that parents are an important source of value and ability information for their children. Little is known, however, about the bidirectional effects between students' perceptions of their parents' beliefs and behaviors and the students' own domain-specific values. This study analyzed how students' perceptions of parents' beliefs and behaviors and students' mathematics values and mathematicsrelated career plans affect each other bidirectionally, and analyzed the role of students' gender as a moderator of these relations. Data from 475 students in 11 th and 12 th grade (girls: 50.3%; 31 classrooms; 12 schools), who participated in two waves of the study, were analyzed. Results of longitudinal structural equation models demonstrated that students' perceptions of their parents' mathematics value beliefs at Time 1 affected the students' own mathematics utility value at Time 2. Bidirectional effects were not shown in the full sample but were identified for boys. The paths within the tested model varied for boys and girls. For example, boys', not girls', mathematics intrinsic value predicted their reported conversations with their fathers about future occupational plans. Boys', not girls', perceived parents' mathematics value predicted the mathematics utility value. Findings are discussed in relation to their implications for parents and teachers, as well as in relation to gendered motivational processes.",
    "spans": [
      {
        "start": 607,
        "end": 610,
        "label": "SAMPLE_SIZE",
        "text": "475"
      }
    ]
  },
  {
    "text": "Only a few studies have examined the direction of associations between academic achievement, interest, and self-concept of ability simultaneously by using longitudinal data over several school years. To examine the cross-lagged relationships between students' interest, self-concept of ability, and performance in mathematics and reading, longitudinal data from Grade 1 to Grade 7 of comprehensive school was gathered from 216 students. The results showed that, in both reading and math, performance predicted students' subsequent self-concept of ability. Some evidence was also found that math performance predicts subsequent interest in mathematics, and that selfconcept of math ability mediates the impact of math performance on interest. No evidence was found for the assumption that self-concept of ability or interest would predict subsequent academic performance.",
    "spans": [
      {
        "start": 423,
        "end": 426,
        "label": "SAMPLE_SIZE",
        "text": "216"
      }
    ]
  },
  {
    "text": "The present investigation was designed to explore the relations between sport participation, peer acceptance, and global self-esteem. Peer acceptance was considered as a possible mediator of the relationship between sport participation and global self-esteem. The sample included girls (N=4,689) and boys (N=5,811) between the ages of 12 and 21 (M=15 years) who were part of the National Longitudinal Study of Adolescent Health. Analyses revealed that peer acceptance partially mediated the relation between sport participation and global self-esteem for girls as well as boys. Findings suggest the importance of considering how sport participation and self-evaluations in particular domains may contribute to global feelings of self-worth. The role of peers in this relationship is discussed in relation to changing social attitudes about girls' sport participation.",
    "spans": [
      {
        "start": 289,
        "end": 294,
        "label": "SAMPLE_SIZE",
        "text": "4,689"
      },
      {
        "start": 308,
        "end": 313,
        "label": "SAMPLE_SIZE",
        "text": "5,811"
      }
    ]
  },
  {
    "text": "Young adolescents grapple with a host of changes that may influence how they perceive themselves: rapid physical and emotional development, the transition to new school environments, and the onset of adolescence. The purpose of this study is to investigate young adolescents' perceptions of self prior to and during their middle grades years. Data were collected from 78 fifth grade students using the Piers Harris Self-Concept Scale beginning in the spring of their fifth grade year and continuing across multiple data points in middle school. Data analyses indicate that young adolescents initially experience positive changes in five of six domainspecific aspects of self-concept after the transition to middle school, followed by subsequent declines to mean ratings at or below their elementary school values. Findings highlight the importance of attending to young adolescents' self-concept needs prior to and during their middle grades experiences.",
    "spans": [
      {
        "start": 368,
        "end": 370,
        "label": "SAMPLE_SIZE",
        "text": "78"
      }
    ]
  },
  {
    "text": "Previous studies revealed that low self-esteem is prospectively associated with depression. However, self-esteem has been shown to change over time. We thus hypothesized that not only level but also change in self-esteem affect depression. Using data from a 23-year longitudinal study (N ϭ 1,527), we therefore examined the prospective effects of global and domain-specific self-esteem (physical attractiveness, academic competence) level and change on depressive symptoms 2 decades later. Self-esteem was assessed annually from age 12 to 16, and depression was assessed at age 16 and 35. Results from latent growth curve analyses demonstrated that both level and change in self-esteem served as predictors for adult depression. Individuals who entered adolescence with low self-esteem, and/or whose selfesteem declined further during the adolescent years, were more likely to exhibit symptoms of depression 2 decades later as adults; this pattern held both for global and domain-specific self-esteem. These findings highlight the importance of adolescent self-esteem development for mental health outcomes in adulthood.",
    "spans": [
      {
        "start": 290,
        "end": 295,
        "label": "SAMPLE_SIZE",
        "text": "1,527"
      }
    ]
  },
  {
    "text": "This study focuses on processes involved in students' academic self-concept constructions before, during, and after secondary school transition. The study is based on a four-wave longitudinal dataset (N = 1953). Structural equation modeling showed that during school transition, the impact of grades on students' academic self-concepts in Math and English decreased whereas the effects of maternal competence perceptions increased. After the transition, the effects of grades increased, while the effects maternal competence beliefs decreased again. The results are interpreted in terms of differential emphasizing of sources of information for students' self-concept construction. During school transition, elementary school grades lost informational value for selfevaluations due to the changed frame of reference. To secure stable and valid selfassessments, students emphasized other sources than grades; in this, case information obtained through parental competence appraisals. After transition, when valid grades were available for the students' constructions again, the temporarily heightened parental influence decreased again.",
    "spans": [
      {
        "start": 205,
        "end": 209,
        "label": "SAMPLE_SIZE",
        "text": "1953"
      }
    ]
  },
  {
    "text": "Background. Children's perceived competence and intrinsic motivation are assumed to be very high at the outset of schooling. However, how they change and how they relate to each other and to academic achievement across early schooling years remain open to question Aims. This 3-year longitudinal study was aimed at examining the following questions. Do children's perceived competence and intrinsic motivation about reading and mathematics change across the first 3 years of schooling? Do their perceived competence and intrinsic motivation differ according to academic domains? Do their perceived competence and intrinsic motivation relate to their academic achievement in each academic domain? Sample. A total of 115 elementary schoolchildren (63 boys and 52 girls) were examined in first grade (mean age = 84,5 months, SD = .67) and for the next 2 years.Children responded to questionnaires about their perceived competence and intrinsic motivation in reading and mathematics. Year-end grades in these two subjects were used as a measure of performance. Results. Changes in perceived competence and intrinsic motivation, and between-year intercorrelations, were observed to differ according to academic domains and gender. Intrinsic motivation did not make a significant contribution to academic achievement at either school grade or in any academic domain, whereas perceived competence was significantly related to achievement at each school grade in both reading and mathematics. Conclusions. Differences between boys and girls observed in this study were not linked to a specific domain and cannot be attributed to gender-role stereotypes. Girls www.bps.org.uk",
    "spans": [
      {
        "start": 715,
        "end": 718,
        "label": "SAMPLE_SIZE",
        "text": "115"
      }
    ]
  },
  {
    "text": "This study examined the relative influence of adolescents' supportive relationships with teachers, peers, and parents on trajectories of different dimensions of school engagement from middle to high school and how these associations differed by gender and race or ethnicity. The sample consisted of 1,479 students (52% females, 56% African American). The average growth trajectories of school compliance, participation in extracurricular activities, school identification, and subjective valuing of learning decreased from 7th to 11th grades (mean ages = 12.9 years to 17.2 years). Different sources of social support were not equally important in their impact on school engagement, and the effect of these sources differed by the aspect of engagement studied. For instance, peer social support predicted adolescents' school compliance more strongly and school identification less strongly than teacher social support. This project was supported by a Pathway to Adulthood Fellowship to Ming-Te Wang and a grant from Spencer Foundation to both Ming-Te Wang and Jacquelynne S. Eccles.",
    "spans": [
      {
        "start": 299,
        "end": 304,
        "label": "SAMPLE_SIZE",
        "text": "1,479"
      }
    ]
  },
  {
    "text": "Introduction. -The contribution of the learning climate and attachment security to students' academic competence and anxiety symptoms during the middle school transition has not been examined. Objectives. -The main purpose of this prospective study was to examine the complementary contributions of these two contextual determinants. A second goal was to test the moderating effect of attachment security perceived by students in the relationship between the learning climate and both outcomes (academic competence, anxiety symptoms). Method and results. -Participants were 627 students in Grade 6 (54% girls). Latent structural modeling analysis revealed that a mastery climate predicted higher levels of perceived academic competence perceived in the first year of middle school, although attachment security to the mother in Grade 6 predicted perceived academic competence and anxiety symptoms in the first year of middle school. A moderating effect was found, in which greater attachment security to the mother appeared to lessen the relationship between a performance climate and anxiety symptoms during the middle school transition. Conclusion. -The results suggest that attachment security to the mother predicts perceived academic competence and anxiety symptoms during the middle school transition. Additionally, attachment security to the mother can moderate the potentially harmful effects of a learning climate emphasizing social comparison and performance on anxiety.",
    "spans": [
      {
        "start": 574,
        "end": 577,
        "label": "SAMPLE_SIZE",
        "text": "627"
      }
    ]
  },
  {
    "text": "Goal orientation theory was used to examine changes in student motivation during the transition from elementary to middle school. Surveys were given to 341 students in the fifth grade in elementary and again in sixth grade in middle school. Students were more oriented to task goals (wanting to improve their competency), perceived a greater emphasis on task goals during instruction, and felt more academically competent in fifth grade in elementary school than in sixth grade in middle school. They perceived a greater emphasis on performance goals (an emphasis on relative ability and right answers) in middle school than in elementary school. Several interactions emerged between year (fifth grade, sixth grade), and both student level of ability (higher, lower, based on standardized achievement tests) and subject domain (math, English). ᭧ 1997Studies suggest that the transition to middle level schools is associated with a decline in motivation and performance for a number of children (see Eccles & Midgley, 1989, for a review). The assumption is sometimes made that these declines are related to physiological and psychological changes associated with puberty and are inevitable. Eccles and Midgley (1989) challenged that assumption, demonstrating that differences in the classroom environment before and after the transition were related to declines in students' expectancies and values in mathematics (e.g., Midgley, Feldlaufer, & Eccles, The research reported in this article was supported by grants from the US Department of Education (R215A00430, R117C80003). Special thanks for comments on earlier drafts of this article to",
    "spans": [
      {
        "start": 152,
        "end": 155,
        "label": "SAMPLE_SIZE",
        "text": "341"
      }
    ]
  },
  {
    "text": "In a five-year longitudinal study, we investigated the role of body objectification in shaping girls' self-esteem and depressive symptoms over the course of adolescence. Multivariate Latent Growth Curve Modeling (MLGM) was used to test the association between body objectification and both self-esteem and depressive symptoms with data from 587 adolescent girls who began the study at age 13 and completed the study at age 18. Results revealed that body objectification decreased, self-esteem increased, and depressive symptoms remained relatively steady across adolescence. Girls who experienced decreases in body objectification also tended to increase in self-esteem and decrease in depressive symptoms over the course of adolescence, even after accounting for several factors known to be associated with positive youth development including race/ethnicity, socioeconomic status, educational achievement, religiosity, and body satisfaction. Practical implications for reducing objectification and enhancing girls' well-being through health, physical, and sexuality education, as well as through media literacy programs are discussed. Directions for future research are also discussed, including a greater focus on the role of race/ethnicity, research on boys, and the need for more experimental studies of body objectification.",
    "spans": [
      {
        "start": 341,
        "end": 344,
        "label": "SAMPLE_SIZE",
        "text": "587"
      }
    ]
  },
  {
    "text": "This research examined changes in intrinsic and extrinsic motivation during the transition from junior to senior high school as well as the impact of motivational changes on various educational consequences (i.e., dropout intentions, absenteeism, homework frequency, and educational aspirations). A total of 646 participants completed a questionnaire in 8th, 9th, and 10th grade. Using the true intraindividual change modeling technique (R. Steyer, I. Partchev, & M. J. Shanahan, 2000), the authors reached results revealing that students' intrinsic motivation and extrinsic motivation decreased gradually from 8th to 10th grade. Furthermore, less educational adjustment was observed for students experiencing a decline in external regulation during the transitional year and students experiencing a decline in intrinsic motivation and identified regulation during the year after the transition.",
    "spans": [
      {
        "start": 308,
        "end": 311,
        "label": "SAMPLE_SIZE",
        "text": "646"
      }
    ]
  },
  {
    "text": "Objective: Although optimism's beneficial role for various life areas is well documented, previous findings regarding its significance for students' achievement at school are inconclusive. This study examined the relation between optimism and academic achievement in early adolescents. It investigated the functional form of this relation, addressed whether the initial achievement level moderates this association, and compared this with effects on self-esteem. Method: We used a large German sample (N 5 6,010; 53.2% females; baseline M age 5 14.1) with two measurement points over a period of 5 months (middle and end of 7th grade). Estimating LOESS curves and latent change-regression models revealed three main findings. Results: (a) Optimism showed a nonlinear association with subsequent changes in academic achievement: Optimism promoted academic achievement, but this positive association reached a plateau in above-average optimism ranges and a minimum value in below-average ranges of optimism. (b) The achievement level at t 1 moderated this relation so that high optimism exerted a more positive effect for high-achieving adolescents. (c) By contrast, optimism had an overall positive effect on self-esteem.The results therefore broaden the evidence on benefits of optimism by linking optimism to academic success in early adolescents but indicate only small and nonlinear associations.",
    "spans": [
      {
        "start": 504,
        "end": 511,
        "label": "SAMPLE_SIZE",
        "text": "5 6,010"
      }
    ]
  },
  {
    "text": "Finding ways to enhance the effectiveness of student learning is of perennial interest to researchers and practitioners alike. One approach to these issues has been to examine the relations between motivation and cognition over time. In addition, it is likely that students perceptions of the classroom context may play a role in facilitating effective learning. The current study examines these issues from a goal orientation theory perspective using a sample of middle school students (n = 306). Data on students' personal motivational beliefs and cognitive strategy use as well as perceptions of the classroom goal structures were gathered using surveys. A longitudinal design was used to examine the research questions. Results suggest that motivation and cognition are reciprocally related over time. In addition, perceptions of classroom context were found to have an explanatory effect over and above the variance explained by prior measures of motivation and cognition. The implications for this work include the notion that student motivation can be enhanced through instruction in cognitive strategy use as well as through alteration of classroom goal structures so that there is a stronger emphasis on tasks and learning rather than on grades or external recognition. A key issue for teachers, parents and administrators alike involves the role of student motivation in the learning process. Most often, we believe that students must",
    "spans": [
      {
        "start": 492,
        "end": 495,
        "label": "SAMPLE_SIZE",
        "text": "306"
      }
    ]
  },
  {
    "text": "This study extends previous research on the long-term connections between motivation constructs in expectancy-value theory and achievement outcomes. Using growth mixture modelling, we examined trajectories of change for 421 students from 4th grade through college in their self-concept of ability (SCA) in math, interest in math, and perceived importance of math. We also assessed how these trajectories relate to choice of college major, focusing on math-intensive and non-intensive majors. Gender, parental income, and initial achievement were included as covariates in the analyses. A 3-class solution best represented underlying trajectories of change for each of the 3 constructs. A latent class relatively high in math self-concept, interest, and importance emerged for each construct respectively, and individuals in these high classes were most likely to choose a math-intensive college major. Interpretations and implications of the trajectories of change and their influence on college major classification are discussed.",
    "spans": [
      {
        "start": 220,
        "end": 223,
        "label": "SAMPLE_SIZE",
        "text": "421"
      }
    ]
  },
  {
    "text": "This study examined the effects of change in teacher goal emphases on students' efficacy beliefs in mathematics across the transition to middle school. The sample (N ϭ 929) included primarily White (65%) and Black (27%) students, and approximately one third received free or reduced-fee lunch. Analyses grouped children by cross-classification of teachers (N ϭ 53 elementary and N ϭ 34 middle school teachers). On average, students' efficacy beliefs remained stable and relatively high across the transition. Compared with their elementary school teacher, children reported declines in both perceived teacher mastery and performance goal emphases in middle school. A cross-classified hierarchical linear model was used to estimate the effects of perceived teacher and parent goal emphases during 6th and 7th grades on changes in students' efficacy beliefs. An increase in self-efficacy beliefs from elementary to middle school was predicted by an increase in group-level perceptions of teachers' mastery goal emphasis, even after controlling for parents' goal emphases. These findings underscore the important role that both teachers' and parents' goal emphases play as children develop a sense of efficacy in mathematics.",
    "spans": [
      {
        "start": 168,
        "end": 171,
        "label": "SAMPLE_SIZE",
        "text": "929"
      }
    ]
  }  
]